{
    "p0": "Conceptos Básicos",
    "p1": ["Al término de la unidad 1, se introdujo el tema de las macros y como crearlas por medio de la herramienta ","Grabar Macro","."],
    "p2": ["En esta unidad se aprenderá a implementar macros por medio de subrutinas, desarrolladas en el lenguaje de programación Visual Basic for Applications (VBA). Pero antes de comenzar a programar es necesario conocer ciertos aspectos básicos de Excel en VBA. Estos aspectos los podemos agrupar en 3: ","Objetos",", ","Propiedades"," y ","Métodos","."],
    "p3": ["Los ","Objetos"," son todos los elementos con que se trabajan en Excel, los más usados son ","Cells"," (celdas), ","Range"," (rango de celdas) y ","Worksheets"," (hojas), pero también lo son los Workbooks (libros), Application (aplicación), Charts (gráficos), entre otros."],
    "p4": "Como se ve cada objeto tiene su nompre propio, pero ya que existen varios del mismo tipo, es necesario conocer la sintáxis para identificarlos.",
    "p5": [["Objeto","Explicación"],
          ["Cells(1,2)","El objeto celda que se encuentra en la fila 1 y columna 2 (B)"],
          ["Range(\"C4\")","El rango de celdas C4, es decir la celda C4"],
          ["Range(\"A1:C3\")","El rango de celdas desde A1 hasta C3"],
          ["Worksheets(3)","La tercera hoja del archivo Excel"],
          ["Worksheets(\"Hoja1\")","La hoja llamada Hoja1 en el archivo"],
          ["Workbooks(\"Libro1.xlsx\")","El libro de Excel nombrado Libro1"],
          ["Application","Representa la aplicación de Excel en su totalidad"]],
    "p6": ["Las ","Propiedades"," son las características de un objeto, así como las celdas tienen un ","Value"," (valor), ","Font Name"," (nombre de fuente) y ","Font Size"," (tamaño de fuente), las hojas y los rangos tiene un ","Name"," (nombre). Así, cada objeto existente, tienes sus propias propiedades que lo identifican."],
    "p7": ["Los ","Métodos"," son las acciones y comportamientos. Además de darles caracteristicas a los objetos se puede realizar tareas con ellos, así es como una celda permite las acciones ","Activate"," (activar) o ","Select"," (seleccionar) y ","ClearContents"," (borrar contenido)."],
    "p8": "Para poder acceder a las propiedades de cierto objeto o implementar sus métodos, se utiliza la sintaxis de punto (.) como se puede ver a continuación:",
    "p9": [["Propiedades","Explicación"],
          ["Cells(1,2).Value","El valor de la celda en la fila 1, columna 2 (B1)"],
          ["Range(\"C4\").Font.Name","El nombre de la fuente del rango C4. Notar que existen dos puntos, ya que Font una gran propiedad que abarca otras propiedades (como Name)"],
          ["Range(\"A1:C3\").Font.Size","El tamaño de la fuente del rango A1 a C3. Notar que existen dos puntos, ya que Font una gran propiedad que abarca otras propiedades (como Size)"],
          ["Worksheets(3).Name","El nombre de la tercera hoja del archivo Excel"]],
    "p10": [["Métodos","Explicación"],
           ["Worksheets(\"Hoja1\").Activate","Activar la hoja llamada Hoja1"],
           ["Range(\"B2:C5\").Select","Seleccionar el rango de celdas B2 a C5"],
           ["Cells(2,3).ClearContents","Borrar el contenido de la celda en la fila 2, columna 3 (C2)"]],
    "p11": "Como se notó en la tabla anterior, existen propiedades que contienen propiedades y para acceder a estas subpropiedades se hace uso igualmente del punto (.). Esto tambien ocurre con los objetos, hay objetos que contienen otros, como por ejemplo una hoja contiene una gran cantidad de celdas. Para acceder correctamente al objeto que deseamos hay que considerar los objetos externos y se debe tener en cuenta la jerarquización. Si un objeto no se menciona, VBA trabajará con el objeto activo.",
    "p12": "Ejemplificando:",
    "p13": [["Objeto","Explicación"],
           ["Workbook(\"Libro1.xlsx\").Worksheets(\"Hoja1\").Cells(1,1)","Se referencia a la celda A1, de la hoja nombrada Hoja1, del archivo llamado Libro1"],
           ["Workbook(\"Libro2.xlsx\").Cells(2,1)","El objeto celda A2, de la hoja activa, del libro llamado Libro2"],
           ["Worksheets(\"Hoja2\").Cells(1,2)","La celda B1, de la hoja nombrada Hoja2, del libro que se encuentra activo"]]
}