{
    "p0": "Subrutinas",
    "p1": "Para poder ejecutar las instrucciones que se aprendieron en la sección anterior, es necesario crear una subrutina con VBA. Una subrutina es un procedimiento que agrupa las instrucciones y las ejecuta secuencialmente, y posee una estructura y sintaxis específica.",
    "p2": ["Se inicia con la palabra reservada ","Sub",", la cual abre la subrutina. Posteriormente, va el nombre que se desea dar la subrutina, para poder identificarla. Este nombre tiene ciertas restricciones: no puede tener espacios, iniciar con números o símbolos, ni ser una palabra reservada de VBA. Es común separar las palabras con guión bajo (_) o con mayúsculas. Luego del nombre, se debe abrir y cerrar paréntesis. Bajo este encabezado van todas las instrucciones necesarias para crear la macro deseada y, finalmente, se debe escribir ","End Sub"," para cerrar la subrutina."],
    "p3": ["Para construir la macro, es necesario acceder a la herramienta ","Visual Basic"," en la pestaña ","Programador o Desarrollador"," (depende de la versión de Excel)."],
    "p4": ["Dentro de esta ventana, se debe ir a la pestaña ","Insertar"," y luego a ","Módulo",", para abrir el editor de texto donde se escribirá la subrutina."],
    "p5": "Construiremos una subrutina como ejemplo para explicar el proceso. Dicha subrutina le asignará valores a dos celdas distintas, y cambiará el tamaño de la fuente de la segunda celda manipulada. En la sección anterior se aprendió a referenciar propiedades de objetos: para modificar, se utiliza el signo igual (=) y a continuación el valor que se le quiere dar.",
    "p6": "Por lo tanto, la subrutina a crear tendrá la siguiente estructura:",
    "p7": ["Note que en las instrucciones no se menciona el libro de Excel, por lo que la subrutina se ejecutará en el libro activo. Para ejecutarla, se debe acceder a la herramienta ", "Macros", " de la pestaña ", "Programador", "."],
    "p8": "Al ejecutar la macro, se procesarán las instrucciones escritas dentro de la subrutina y el resultado quedará reflejado en el archivo.",
    "p9": ["Importante:"," Los cambios efectuados por medio de macros no podrán ser eliminados mediante la herramienta ", "Deshacer", " (Ctrl + Z)."],
    "p10": ["Consejo:"," Si se desconoce el código para ejecutar cierta acción, se recomienda realizar la acción mediante grabación de macros y luego analizar el código generado."]
}