{
    "p0": "Variables",
    "p1": ["En el mundo de la programación los datos no son estáticos. Éstos se pueden modificar, trabajar con ellos e incluso ser desconocidos, ya que el usuario debe proveerlos. Para poder trabajar con los datos, es necesario almacenarlos con anterioridad en una ","variable","."],
    "p2": "Una variable es un espacio de memoria que puede almacenar un dato. Se le representa como una caja cuyo interior posee el dato almacenado. Para poder crear una variable, se requiere conocer de antemano dos aspectos: un nombre y el tipo de dato. El nombre de la variable respeta las mismas reglas que el nombre de la subrutina. Por otro lado, el tipo de dato es exactamente eso, la clase de dato que puede almacenar la variable.",
    "p3": "Existe una gran cantidad de tipos de dato. Algunos de ellos son:",
    "p4": [["Tipo de Dato","Descripción"],
          ["Integer","Números enteros, positivos y negativos"],
          ["Double","Número decimales, positivos y negativos"],
          ["String","Texto, debe escribirse entre comillas (\"\")"],
          ["Boolean","Dato que solo puede tener los valores True (verdadero) o False (falso)"],
          ["Variant","Cualquier tipo"]],
    "p5": "Declarar y darle valor a las variables tiene una sintáxis especifica",
    "p6": ["Para crear una variable se usa la palabra reservada ","Dim",", luego el ","nombre"," que se le quiere asignar, y finalmente la palabra reservada ","As",", seguida del ","tipo de dato"," que almacenará la variable creada. Para darle un valor a una variable existente, se debe escribir el ","nombre de la variable",", continuada por el signo igual (=) y el ","valor"," que se quiere almacenar (claramente, debe coincidir con el tipo de dato definido)."],
    "p7": ["Es posible darle valor a variables sin declararlas antes (creándose en el momento), pero si no se maneja con cuidado puede generar problemas en el código. Evitaremos este enfoque durante el curso. Para forzar la declaración de variables se utiliza la instrucción ","Option Explicit"," al inicio del editor de texto, antes de la subrutina."],
    "p8": "A continuación se puede apreciar un código de ejemplo trabajando con variables.",
    "p9": "En el siguiente video puede verse la ejecución de la subrutina."
}