{
    "p0": "Controles",
    "p1": "En esta sección se estudiarán los controles en profundidad. Cada control tiene un comportamiento determinado, y puede ser utilizado con diferentes objetivos. No obstante, su uso y preparación es similar.",
    "p2": "Como información preliminar, es necesario tener los datos que despliegan la mayoría de los controles en el mismo Excel, por lo tanto se sugiere tener una hoja exclusiva para los datos que tendrán los controles.",
    "p3": ["Para insertar un ","control de formulario"," se sigue el mismo procedimiento que al insertar una forma o cuadro de texto: se debe seleccionar el control deseado y luego hacer click, mantener el click y arrastrar en la hoja de Excel para crearlo. Si se desea modificar su tamaño o posición, se debe seleccionar mediante ","ctrl + click izquierdo"," ya que con un click simple se activará el control."],
    "p4": "Cuadro combinado",
    "p5": ["El primer control a estudiar es el ","cuadro combinado",". Este cuadro permite desplegar una lista y seleccionar una de las opciones de ésta. Para configurar su funcionamiento, es necesario acceder al ","formato de control"," mediante el click derecho. Existen 3 secciones importantes:"],
    "p6": ["Rango de entrada:", " Estos son los datos que se desplegarán en la lista. Se debe ingresar el rango deseado desde una hoja de Excel. Si se ingresa un rango con más de una columna, solo se considerará la primera columna del rango."],
    "p7": ["Vincular con la celda:", " La celda ingresada en este apartado será aquella que mostrará la opción seleccionada. El resultado en esta celda será la posición en el rango del dato seleccionado. Así, si se selecciona la tercera opción, se mostrará el número 3. Esta celda es importante ya que entrega la información de qué se está seleccionando en el cuadro combinado. En caso de no existir una opción seleccionada, el valor de la celda será 0."],
    "p8": ["Líneas de unión verticales:"," El número ingresado determinará el largo de la lista desplegada. Si hay más opciones que el número ingresado se habilitará una barra en el cuadro para realizar un desplazamiento vertical."],
    "p9": "Cuadro de lista",
    "p10": ["El ","control de cuadro"," tiene el mismo comportamiento y finalidad que el ","cuadro combinado",", con algunos detalles particulares. En lugar de desplegarse la lista, ésta se muestra en su totalidad o mediante un desplazamiento si es necesario."],
    "p11": ["Mediante el ","formato de control"," se asignan los componentes de rango de entrada y vincular celda, pero en lugar de las lineas verticales existe el componente de tipo de selección. El tipo simple declara el mismo comportamiento que el cuadro combinado. En cambio, los tipos multiple y extendido permiten seleccionar varias opciones de la lista. En este curso no se trabajará con ellas, ya que la complejidad de su comportamiento excede los límites de los objetivos de la asignatura."],
    "p12": "Control de número",
    "p13": ["El ","control de número"," permite al usuario seleccionar una cantidad sin tener que escribirla explícitamente, sino que la define presionando botones de incremento y decremento. Este control es útil para montos acotados, ya que abarcar un rango extenso con este tipo de control puede ser molesto para el usuario. En complemento, facilita la restricción de los valores a ingresar, evitando que el usuario escriba un valor no permitido. Para asegurarnos de esto último, es necesario bloquear la celda donde se escribe el número. Las secciones del control son las siguientes:"],
    "p14": ["Valor actual:"," Corresponde al valor inicial del control. Aparecerá en la celda vinculada."],
    "p15": ["Valor mínimo:"," Corresponde al mínimo valor que podrá ingresarse. Al llegar a este valor e intentar disminuirlo, no se gatillará ningún cambio."],
    "p16": ["Valor máximo:"," Cumple el mismo funcionamiento que el valor mínimo, pero con el valor máximo."],
    "p17": ["Incremento:"," Corresponde a la cantidad que aumentaremos (o disminuiremos) al pulsar los botones de incremento y decremento. Es posible definir un incremento secuencial (aumentar/disminuir el valor en 1), o mayor, según lo requiramos."],
    "p18": ["Cambio de página:"," Esta característica se encuentra deshabilitada para el control de número. Se trabaja con el control de barra de desplazamiento y es el incremento que se produce al clickear en la misma barra en lugar de los botones. La barra de desplazamiento no se especificará en esta plataforma, pero su comportamiento es igual al control de número."],
    "p19": ["Vincular con la celda:"," Es la celda donde aparecerá el resultado al clickear los botones de incremento o decremento. Es recomendable bloquear o realizar una validación de datos en la celda para que el usuario no ingrese datos fuera de rango de forma manual."],
    "p20": "Botón de opción",
    "p21": ["Este control permite seleccionar solo una opción de un conjunto. Para configurarlo, en ","formato de control"," es necesario vincular una de las opciones con la celda deseada, los otros ","botón de opción"," se vinculan de forma automática con la misma celda, ya que Excel interpreta que todas forman parte del mismo grupo. Con las opciones vinculadas, al seleccionar una opción se mostrará en la celda el número de la opción elegida (El número de la opción corresponde al orden de creación). En caso que ninguna opción esté seleccionada el número será 0."],
    "p22": ["Si se desea tener ","botones de opción"," independientes, es necesario utilizar el control de formulario ","Cuadro de grupo",". Este control es simplemente un borde rectangular al cual se le puede poner un título. Crear ","botones de opción"," dentro de un ","cuadro de grupo"," hará que trabajen de forma independiente de aquellas que están fuera del grupo, tal como se muestra en el siguiente ejemplo:"],
    "p23": "Casilla",
    "p24": ["El ","control de casilla"," le permite al usuario seleccionar una o más opciones de un grupo. La configuración difiere un tanto del ","botón de opción"," ya que cada control debe vincularce a una celda distinta (para sencillez del video algunos controles ya se encuentran vinculados). La celda vinculada mostrará el valor VERDADERO si la casilla está seleccionada y el valor FALSO si no lo está. Cabe destacar que si la casilla nunca ha sido seleccionada el valor de la celda será vacío inicialmente, por lo que el valor de la celda vinculada de una casilla no seleccionada puede ser FALSO o vacío. El valor mixto no se contemplará en este curso."],
    "p25": ["Ya que cada ","control de casilla"," es independiente uno de otro, no es necesario el uso del ","control de grupo"," para separar opciones de distintos contextos, pero puede ayudar para realizar una distinción visual."],
    "p26": "Botón",
    "p27": ["El ","botón"," es el control de formulario que más difiere del resto pero también el más simple. Su ","formato de control"," solo posee configuraciones estéticas, y para utilizarlo es necesario asociarle una macro. Para ello, una vez creada la macro, con el click derecho sobre el botón se accede a ","Asignar macro..."," y se selecciona la macro que se desea asociar al ","botón",". Posterior a esto, cada vez que se presione el ","botón"," la macro asignada se ejecutará."]
}