{
    "p0": "Controles",
    "p1": "En este tópico se tratarán los controles en profundidad. Cada uno tiene su propio comportamiento y puede ser usado con diferentes objetivos, pero su uso y preparación es similar entre varios.",
    "p2": "Como información preliminar, los datos que despliegan la mayoria de los controles es necesario tenerlos en el mismo Excel, por lo tanto se sugiere tener una hoja enfocada a los datos que tendrán los controles.",
    "p3": ["Para insertar un ","control de formulario"," se debe hacer click en el deseado y luego en la hoja al hacer click y arrastrar se creará el control en el lugar seleccionado, tal cual se crea un forma. Si se desea modificar su tamaño o posición, se debe seleccionar mediante ","ctrl + click izquierdo"," ya que con un click simple se activará el control."],
    "p4": "Cuadro combinado",
    "p5": ["El primer control a estudiar es el ","cuadro combinado",". Este cuadro permite desplegar una lista y seleccionar una de las opciones ésta. Para configurar su funcionamiento es necesario acceder al ","formato de control"," mediante el click derecho. Existen 3 secciones importantes:"],
    "p6": ["Rango de entrada:", " Estos son los datos que se desplegarán en la lista. Se debe ingresar el rango deseado desde una hoja de excel, si se ingresa un rango con más de una columna, solo se considerará la primera columna del rango."],
    "p7": ["Vincular con la celda:", " La celda ingresada en este apartado será la celda que mostrará la opción seleccionada. El resultado en esta celda será la posición en el rango del dato seleccionado. Así, si se selecciona la tercera opción, se mostrará el número 3. Esta celda es importante ya que entrega la información de qué se está seleccionando en el cuadro combinado. En caso de no existir una opción seleccionada, el valor de la celda será 0."],
    "p8": ["Líneas de unión verticales:"," El número ingresado determinará el largo de la lista desplegada. Si hay más opciones que el número ingresado se habilitará una barra en el cuadro para realizar un desplazamiento vertical."],
    "p9": "Cuadro de lista",
    "p10": ["El ","control de cuadro"," tiene el mismo comportamiento y finalidad que el ","cuadro combinado",", con algunos detalles particulares. En lugar de desplegarse la lista, ésta se muestra en su totalidad o mediante un desplazamiento si es necesario."],
    "p11": ["Mediante el ","formato de control"," se asignan los componentes de rango de entrada y vincular celda, pero en lugar de las lineas verticales existe el componente de tipo de selección. El tipo simple declara el mismo comportamiento que el cuadro combinado, en cambio, el tipo multiple y extendido permite seleccionar varias opciones de la lista pero no se trabajará con ellas en el curso ya que tienen un comportamiento más complejo."],
    "p12": "Control de número",
    "p13": ["El ","control de número"," permite al usuario seleccionar un monto sin tener que escribirlo, en cambio, lo establece presionando botones de incremento o decremento. Este comportamiento es útil para montos acotados, ya que un rango extenso puede ser molesto para el usuario. En complemento, facilita la restricción de los valores a ingresar, evitando que el usuario escriba un valor no permitido. Para reafirmar esto es necesario bloquear la celda donde se escribe el número. Las secciones del control son las siguientes:"],
    "p14": ["Valor actual:"," Este es el valor con el cual iniciará el control, aparecerá en la celda vinculada."],
    "p15": ["Valor mínimo:"," Tal como dice su nombre, es el valor menor que se puede ingresar. Al estar en este valor e intentar disminuir no provocará ningún cambio."],
    "p16": ["Valor máximo:"," Cumple el mismo funcionamiento que el valor mínimo pero con el valor máximo."],
    "p17": ["Incremento:"," Es el cambio de número que se produce al apretar tanto el botón de incremento como decremento, es posible un cambio contiguo o ir de dos en dos e incluso saltos mayores."],
    "p18": ["Cambio de página:"," Esta característica se encuentra deshabilitada para el control de número. Se trabaja con el control de barra de desplazamiento y es el incremento que se produce al clickear en la misma barra en lugar de los botones. La barra de desplazamiento no se especificará en esta plataforma pero su comportamiento es igual al control de número."],
    "p19": ["Vincular con la celda:"," Es la celda donde aparecerá el resultado al clickear los botones de incremento o decremento. Es recomendable bloquear o realizar una validación de datos en la celda para que el usuario no ingrese datos fuera de rango de forma manual."],
    "p20": "Botón de opción",
    "p21": ["Este control permite seleccionar solo una opción de un conjunto. Para configurarlo, en ","formato de control"," es necesario vincular una de las opciones con la celda deseada, los otros ","botón de opción"," se vinculan de forma automática con la misma celda, ya que Excel interpreta que todas forman parte del mismo grupo. Con las opciones vinculadas, al seleccionar una opción se mostrará en la celda el número de la opción elegida (El número de la opción corresponde al orden de creación). En caso que ninguna opción esté seleccionada el número será 0."],
    "p22": ["Si se desea tener ","botones de opción"," independientes, es necesario utilizar el control de formulario ","Cuadro de grupo",". Este control es simplemente un borde rectangular al cual se le puede poner un título. Crear ","botones de opción"," dentro de un ","cuadro de grupo"," hará que trabajen de forma independiente de cuales están fuera del grupo. Tal como se ve en el siguiente ejemplo:"],
    "p23": "Casilla",
    "p24": ["El ","control de casilla"," le permite al usuario seleccionar una o más opciones de un grupo. La configuración difiere un tanto del ","botón de opción"," ya que cada control debe vincularce a una celda distinta (para sencillez del video algunos controles ya se encuentran vinculados). La celda vinculada mostrará el valor VERDADERO si la casilla está seleccionada y el valor FALSO si no lo está. Cabe destacar que si la casilla nunca ha sido seleccionada el valor de la celda será vacío inicialmente, por lo que el valor de la celda vinculada de una casila no seleccionada puede ser FALSO o vacío. El valor mixto no se contemplará en este curso."],
    "p25": ["Ya que cada ","control de casilla"," es independiente uno de otro, no es necesario el uso del ","control de grupo"," para separar opciones de distintos contextos, pero puede ayudar para realizar una distinción visual."],
    "p26": "Botón",
    "p27": ["El ","botón"," es el control de formulario que más difiere del resto pero también el más simple. Su ","formato de control"," solo posee configuraciones esteticas y para utilizarlo es necesario asociarle un macro. Se debe crear un macro que realice algun procedimiento deseado, luego con el click derecho en el botón se accede a ","Asignar macro..."," y se selecciona la macro a la cual se quiere asociar el ","botón",". Posterior a esto, cada vez que se presione el ","botón"," la macro asignada se ejecutará."]
}