{
    "p0": "Ejemplo de Uso",
    "p1": ["Para una mejor comprensión del uso de los ","controles de formularios",", se verá una aplicación de cada uno de ellos mediante el archivo de ejemplo. El archivo posee 3 hojas:"],
    "p2": ["Ingreso:"," La primera hoja contiene el formulario que utilizaremos. Mediante el uso de controles, es posible seleccionar varios aspectos para realizar la compra de un producto, como vendedor, cantidad, descuento, etc."],
    "p3": ["Registros:"," En la segunda hoja se almacenan los registros de cada compra realizada. Los ingresos de la hoja anterior realizados correctamente se irán almacenando en la tabla de esta hoja, agregándose en la última fila mediante una macro."],
    "p4": ["Datos:"," La tercera hoja almacena toda la información para que los controles funcionen correctamente, así como las celdas vinculadas para extraer la información de los controles."],
    "p5": "A continuación es posible observar el modo de uso del formulario y el resultado obtenido.",
    "p6": "Al seleccionar los elementos de los controles se verán modificadas las celdas vinculadas, las cuales podremos usar para extraer la información seleccionada por el usuario.",
    "p7": ["Para ingresar los datos en la hoja ","Registros"," se utilizará la macro ","Ingresar",", asociada al botón del mismo nombre. A continuación se presenta un extracto del código de la macro mencionada, donde se ve como es el proceso para extraer la información."],
    "p8": "Es necesario crear una variable para cada dato solicitado o calculado. Los elementos que se encuentran explícitos en la hoja se pueden extraer tal como se ha realizado durante el curso, pero con los controles (que corresponden a las líneas marcadas en la imagen) es algo distinto.",
    "p9": ["Los datos de los controles de ","cuadro combinado",", correspondientes a las variables de vendedor y producto, se extraen mediante la lista en la hoja de ","Datos",". Se ubica el encabezado de la lista pertinente, y se suma a la fila el número del elemento seleccionado, para que así se extraiga el vendedor o producto seleccionado por el usuario."],
    "p10": ["Para el control de ","botón de opción"," se extraen utilizando la estructura condicional ","If",": el número que está seleccionado es el valor que se le dará a la variable. De la misma forma opera el ","control casilla",", solo que en este caso se almacenan los descuentos en la misma variable y se va concatenando el texto en medida de los descuentos seleccionados. Finalmente, se elimina el último carácter que es el guión final. Este procedimiento es realizado dado el contexto, y es posible manejarlo de formas distintas."],
    "p11": "El resto de los datos son extraidos de forma directa de la celda correspondiente y en donde sea necesario el valor es calculado mediante fórmulas en la misma celda.",
    "p12": ["Posteriormente, es necesario verificar que todos los datos estén ingresados correctamente. Luego, encontrar la última fila de la hoja ","Registros"," para escribir los datos recolectados en la siguiente fila."]
}