{
    "p0": "Tablas dinámicas",
    "p1": ["En este apartado se trabajarán las ","tablas dinámicas",". Estas son tablas modificables en tiempo real al variar ciertos filtros aplicados, campos analizados e incluso los valores estudiados. Son realmente útiles para analizar con mayor profundidad los campos de la tabla original y comparar aspectos entre ellos."],
    "p2": ["Se puede agregar una tabla dinámicas desde la pestaña ","Insertar",", tal como se ve en la imagen siguiente."],
    "p3": "Al ingresar desde una tabla o rango se desplegará la siguiente ventana:",
    "p4": "Aquí es posible seleccionar el rango de celdas con la cual se generará la tabla dinámica (es importante incluir encabezados) y, además, seleccionar si se desea colocar la tabla en una nueva hoja o una ya existente. El proceso completo para generar la tabla dinámica puede observarse a continuación:",
    "p5": "Aparecerán dos nuevos elementos una vez creada la tabla, los cuales se ilustran en la siguiente imagen: el apartado de la izquierda, donde se mostrará la tabla dinámica; y el apartado de la derecha, donde se realizará el trabajo. En la zona superior se encuentran los encabezados de la tabla original; abajo de ésta hay 4 secciones, donde se insertarán los campos para generar la tabla dinámica.",
    "p6": "Se desglosará cada sección y como se comportan entre ellas para un mejor entendimiento y manejo.",
    "p7": ["Filas:"," Lo ingresado en este campo será lo mostrado como etiqueta de fila, es decir, serán los elementos mostrados a la izquierda de la tabla dinámica; las etiquetas de lo evaluado y estudiado. Si se ingresa más de un encabezado en el campo, se generará una jerarquía con subetiquetas tal como se relacionan los datos de esos encabezados. Es importante el orden de los encabezados en el campo, ya que la jerarquía se ve afectada por ello, tal como se aprecia a continuación."],
    "p8": ["Valores:"," Lo ingresado en este campo será mostrado como un valor numérico resumido en cada fila. Si los datos ingresados son de tipo numérico, por defecto se mostrará la suma de ellos. En cambio, si son de tipo texto se mostrará la cuenta. Este cálculo se relaciona respecto a cada elemento del campo filas, mostrando así la información segmentada. El tipo de cálculo (suma, cuenta, etc.) es modificable por si se prefiere otro tipo de análisis. Finalmente, cada encabezado agregado a este campo se irá ingresando como una nueva columna a la tabla dinámica."],
    "p9": ["Columnas:"," El campo Columnas cumple la misma función que el campo Filas pero secciona los datos por columna, siendo mostradas las etiquetas en la sección superior de la tabla. La jerarquía se comporta igual que en el campo Filas y, además, se relaciona de igual manera con el campo Valores, mostrando los valores numéricos en cada columna."],
    "p10": ["Filtros:"," El campo Filtros tiene la misma funcionalidad que los filtros estudiados en el tópico anterior. A este campo se agregan los encabezados que desean utilizarse para filtrar la información. Se agregará una nueva área superior a la tabla dinámica donde estarán los campos para filtrar. Desde ahí es posible modificar el contenido mostrado en la tabla dinámica."],
    "p11": ["Para finalizar, en conjunto a la tabla dinámica es posible generar un ","gráfico dinámico",", el cual se actualizará en tiempo real a medida que los datos de la tabla cambien. Esta funcionalidad es muy práctica para un análisis gráfico."]
}