{
    "p0": "Conceptos Básicos",
    "p1": "Al abrir un nuevo archivo de Excel, se despliega en pantalla la siguiente vista, mostrando la base del archivo. En la sección superior se podrá elegir si es que se desea crear un nuevo archivo (conocido como Libro) en blanco, o a partir de una plantilla predefinida. La sección inferior da la opción de abrir un archivo recientemente usado.",
    "p2": ["La primera opción ","Libro en blanco"," nos creará un libro de Excel vacío, donde se podrá trabajar desde cero. A continuación se explicará el entorno de trabajo de un libro, especificando las secciones y elementos."],
    "p3": "Entorno de Excel",
    "p4": ["Pestañas:"," El recuadro gris abarca las pestañas de Excel. haciendo click en ellas se mostrarán distintos conjuntos de botones, acciones y características. La pestaña ","Inicio"," es la desplegada por defecto y dentro de la pestaña ","Archivo"," podremos guardar el libro."],
    "p5": ["Celdas:"," Dentro del cuadro negro se pueden apreciar las celdas. Una celda es un sección donde se pueden ingresar valores tales como texto, datos numéricos, e incluso fechas. Esta es la sección donde se manipularán los datos. La celda activa se representa con un borde verde más grueso."],
    "p6": ["Barra de fórmulas:"," La caja de texto dentro del cuadro naranjo es la barra de fórmulas. Aquí se desplegará la totalidad del contenido de la celda seleccionada y de forma literal. En caso de la celda tener una fórmula, en la celda se mostrará el resultado y en esta caja se podrá observar la fórmula o función en sí (se abarcará este tópico en la siguiente sección). Además, con el botón ","fx"," a la izquierda se desplegará una ventana con todas las funciones de Excel."],
    "p7": ["Filas: "," Las celdas se organizan en forma matricial, es decir, se ordenan por filas y columnas. En la barra de la izquierda (recuadro verde) se pueden apreciar el número de fila de cada celda. Si se mantiene un click entre dos números de filas, es posible modificar la altura de la fila moviendo el mouse."],
    "p8": ["Columnas: "," Dentro del recuadro violeta se especifica la columna a la cual pertenece cada celda. Al igual que las filas, es posible modificar el ancho de la columna. Es importante notar que las filas de las celdas se identifican con números, mientras que las columnas se representan con letras. Excel utiliza la notación ColumnaFila para identificar una celda. Por ejemplo, la celda activa en la foto superior corresponde a la celda B2."],
    "p9": ["Propiedades de celda: "," Es posible modificar la apariencia de la información contenida en la celda. El recuadro azul encierra las propiedades de la celda, con las cuales es posible cambiar el tipo de letra usado, su tamaño, color y posición dentro de la misma. También se puede modificar el color de fondo de la celda, el grosor y color de sus bordes, entre otros."],
    "p10": ["Hojas: "," Al conjunto de celdas se le conoce como ","Hoja",", la cual está reflejada en el recuadro rojo. Un libro de Excel puede tener varias hojas, las cuales pueden ser añadidas con el botón + a la derecha, y modificadas al hacer click derecho sobre su nombre. De esta forma no es necesario tener varios libros de Excel si se tiene información del mismo contexto; solo necesitamos tener varias hojas dentro del mismo libro."],
    "p11": "Rango y arrastrar",
    "p12": ["Además de seleccionar una celda por si sola, es posible seleccionar varias celdas al mismo tiempo. Lo anterior se conoce como ","Rango",", y es útil para modificar varias celdas simultáneamente, e incluso copiar un conjunto de datos. Es identificable ya que las celdas incluidas en el rango tienen el borde verde (lo cual representa que están activas)."],
    "p13": "A partir de una celda o un rango de ellas, es posible duplicar el contenido (o extenderlo) solo seleccionando y arrastrando. Para lograrlo, se debe mantener el click en el pequeño cuadrado inferior derecho de la celda o rango activo y arrastrar hacia la dirección que se desee para duplicar/extender.",
    "p14": "Existen 3 tipos de arraste. El primero ocurrirá al tener un dato genérico en una celda o rango; en este caso, al realizar el arrastre, se copiarán los datos en las celdas seleccionadas.",
    "p15": "El segundo tipo de arrastre se produce al seleccionar un rango de números. El arrastre evaluará la diferencia entre los números y continuará la cuenta.",
    "p16": "El último tipo de arrastre ocurre en casos especiales, con palabras pertenecientes a un patrón determinado y que Excel completará. Ejemplo de estos patrones son los días de la semana o los meses del año."
}