{
    "p0": "Conceptos Básicos",
    "p1": "Al abrir un nuevo archivo de Excel, se despliega en pantalla la siguiente imagen, mostrando la base del archivo. Esta sección se subdivide en 2, en la superior se podrá elegir crear un nuevo archivo (conocido como Libro) en blanco o una plantilla predefinida. La sección inferior da la opción de abrir un archivo recientemente usado.",
    "p2": "La primera opción 'Libro en blanco' nos creará un libro de Excel vacio, donde se podrá trabajar desde cero. A continuación se explicará el entorno de trabajo de un libro, especificando las secciones y elementos.",
    "p3": "Entorno de Excel",
    "p4.1": "Pestañas: ",
    "p4.2": "El recuadro gris abarca las pestañas de Excel, haciendo click en ellas se mostrarán distintos conjuntos de botones, acciones y caracteristicas. La pestaña 'Inicio' es la desplegada por defecto y dentro de la pestaña 'Archivo' podremos guardar el libro.",
    "p5.1": "Celdas: ",
    "p5.2": "Dentro del cuadro negro se pueden apreciar las celdas. Una celda es un sección donde se pueden ingresar valores, así como texto, datos númericos, e incluso fechas u otros. Esta es la sección donde se trabajará y trataran los datos. La celda activa se representa con un borde verde más grueso.",
    "p6.1": "Barra de formulas: ",
    "p6.2": "La caja de texto dentro del cuadro naranjo es la barra de formulas. Aquí se desplegará la totalidad del contenido de la celda seleccionada y de forma literal. En caso de la celda tener una formula, en la celda se mostrará el resultado y en esta caja se podrá observar la formula o función en sí (se abarcará este tópico en la siguiente sección). Además, con el botón 'fx' a la izquierda se desplegará una ventana con todas las funciones de Excel.",
    "p7.1": "Filas: ",
    "p7.2": "Para identificar las celdas, éstas están ordenadas de forma matricial, ordenadas por filas y columnas. En la barra de la izquierda (recuadro verde) se pueden apreciar el número de fila de cada celda. Si se mantiene un click entre dos números de filas, es posible modificar la altura de la fila moviendo el mouse.",
    "p8.1": "Columnas: ",
    "p8.2": "Dentro del recuadro violeta, se especifica la columna a la cual pertenece cada celda, de la misma forma que las filas, es posible modificar el ancho de la columna. Es importante notar que las filas de las celdas se identifican con números, pero en cambio, las columnas se representan con letras. Finalmente, para identificar una celda se menciona como ColumnaFila, por ejemplo, la celda B2 es la celda activa en la foto superior.",
    "p9.1": "Propiedades de celda: ",
    "p9.2": "Es posible modificar de que forma se verá la información dentro de la celda, el recuadro azul encierra las propiedades de la celda. Con ellas es posible cambiar el tipo de letra usado, su tamaño, color y posición dentro de la celda. También se puede modificar el color de fondo de la celda, el grosor y color de sus bordes, entre otros.",
    "p10.1": "Hojas: ",
    "p10.2": "Al conjunto de celdas se le conoce como Hoja, la cual está reflejadas en el recuadro rojo. Un libro de Excel puede tener varias hojas, agregandolas con el boton '+' a la derecha y permitiendo modificarlas al hacer click derecho sobre el nombre de ellas. De esta forma, si se tiene información del mismo contexto, no es necesario tener varios libros de Excel, sino varias hojas dentro el mismo libro.",
    "p11": "Rango y arrastrar",
    "p12": "Además de seleccionar una celda por si sola, es posible seleccionar varias celdas al mismo tiempo, seleccionando lo conocido como un Rango. Esto es util para modificar varias celdas simultaneamente e incluso copiar un conjunto de datos. Es identificable ya que las celdas incluidas en el rango tienen el borde verde que representa que están activas.",
    "p13": "A partir de una celda o un rango de celdas, es posible seleccionar y arrastrar para duplicar el contenido o continuarlo. Para esto, se debe mantener el click en el pequeño cuadrado inferior derecho de la celda o rango activo y arrastrar hacia la dirección que se desee para duplicar.",
    "p14": "Existen 3 tipos de arraste. El primero ocurrirá al tener un dato genérico en una celda o rango, al realizar el arrastre se copiarán los datos en las celdas seleccionadas.",
    "p15": "El segundo tipo de arrastre se produce al seleccionar un rango de números. El arrastre evaluará la diferencia entre los números y continuará la cuenta.",
    "p16": "El último tipo de arrastre ocurre en casos especiales, con palabras pertenecientes a un patrón y que Excel completará, como lo son los días de la semana o los meses del año."
}