{
    "p0": "Funciones",
    "p1": "Dentro de Excel existen formulas ya creadas, las cuales están a libre disposición del usuario y pueden ser usadas mediante un nombre y argumentos, estas son llamadas funciones. Existen funciones de todo tipo como se verá a continuación y para utilizarlas todas respetan la misma sintaxis, explicada en la siguiente imagen.",
    "p2": "Como las funciones son fórmulas, inician igualmente con un signo igual (=). Luego se debe escribir el nombre de la función y entre parentesis van los argumentos de la función separados por punto y coma (;). Un argumento es un valor que recibe la función para trabajar con él y poder dar un resultado, al igual que las funciones usadas en matemáticas. Si en la descripción de una función, el argumento se encuentra entre paréntesis de corchete ([ ]), quiere decir que es opcional su ingreso. Cabe destacar que a veces es posible utilizar una función como argumento de otra función, en este caso la función argumento no lleva el signo igual (=).",
    "p3": "Para encontrar las funciones se debe hacer click en el botón 'fx' a la izquierda de la barra de formulas o en la pestaña 'Formulas'. Se desplegará la siguiente ventana donde se podrán encontrar las funciones separadas por categoría, en conjunto a la descripción de cada una y los argumentos que recibe.",
    "p4": "A continuación, se tratarán brevemente las funciones más usadas de cada categoría.",
    "p5": "Funciones Matemáticas",
    "p6": "Dentro del repertorio de funciones matemáticas se pueden encontrar para resolver calculos trigonométricos, estadísticos, financierons y de matemática básica. Los más comunes a utilizar son los siguientes",
    "p7": "Función",
    "p8": "Descripción",
    "p9": "=ALEATORIO.ENTRE(número1;número2)",
    "p10": "Devuelve un número aleatorio entre los valores número1 y número2 entregados",
    "p11": "=REDONDEAR(número;cantidadDecimales)",
    "p12": "Devuelve el número entregado redondeado a la cantidad de decimales especificados",
    "p13": "=SUMA(número1;número2;...)",
    "p14": "Devuelve la suma de todos los números entregados. Recibe una cantidad variable de argumentos.",
    "p15": "=SUMAR.SI(rangoNúmeros;criterio;[rangoSuma])",
    "p16": "A partir del rango de números entregado, verifica elemeno por elemento si cumple el criterio lógico proporcionado, en caso de cumplirlo suma los elemento correspondiente de rangoSuma, si éste no fue proporcionado realiza la suma con rangoNúmeros. Para una explicación más detallada revise los videos adjuntos.",
    "p17": "=PROMEDIO(número1;número2;...)",
    "p18": "Devuelve el promedio de todos los números entregados. Recibe una cantidad variable de argumentos.",
    "p19": "=MAX(número1;número2;...)",
    "p20": "Devuelve el número mayor de todos los números entregados. Recibe una cantidad variable de argumentos.",
    "p21": "=MIN(número1;número2;...)",
    "p22": "Devuelve el número menor de todos los números entregados. Recibe una cantidad variable de argumentos.",
    "p23": "=CONTAR(valor1;valor2;...)",
    "p24": "Devuelve la cantidad de valores numéricos entregados. Usualmente usado referenciando una rango de celdas para saber la cantidad de estas que tienen valores numéricos.",
    "p25": "=CONTAR.SI(rango;criterio)",
    "p26": "A partir del rango entregado, cuenta la cantidad de celdas que cumplen con el criterio lógico entregado. Para una explicación más detallada revise los videos adjuntos.",
    "p27": "=CONTARA(valor1;valor2;...)",
    "p28": "Devuelve la cantidad de valores no vacios entregados. Usualmente usado referenciando una rango de celdas para saber la cantidad de estas que no están vacias.",
    "p29": "Funciones de Texto",
    "p30": "Es posible trabajar con texto mediante las funciones, así como obtener ciertas secciones de ellos, compararlos y transformarlos. Es importante mencionar que si el texto del argumento es ingresado textual (y no como referencia), éste debe ir rodeado de comillas (\" \").",
    "p31": "Función",
    "p32": "Descripción",
    "p33": "=CONCAT(texto1;texto2;...)",
    "p34": "Concatena (une) los textos entregados, formando un solo texto. Recibe una cantidad variable de argumentos.",
    "p35": "=IGUAL(texto1;texto2)",
    "p36": "Compara el texto1 y texto2, entregando VERDADERO si son iguales o FALSO si son distintos.",
    "p37": "=LARGO(texto)",
    "p38": "Devuelve el largo del texto entregado, la cantidad de carácteres.",
    "p39": "=MAYUSC(texto)",
    "p40": "Transforma el texto entregado, escribiendolo solo con mayúsculas.",
    "p41": "=MINUSC(texto)",
    "p42": "Transforma el texto entregado, escribiendolo solo con minúsculas.",
    "p43": "=NOMPROPIO(texto)",
    "p44": "Transforma el texto entregado, escribiendo con mayúscula la primera letra de cada palabra y el resto en minúsculas.",
    "p45": "=ENCONTRAR(texto1;texto2)",
    "p46": "Busca el texto1 en el texto2 y entrega la posición en que lo encuentra.",
    "p47": "=IZQUIERDA(texto;número)",
    "p48": "Extrae la cantidad de carácteres especificada por número desde texto, iniciando de la izquierda.",
    "p49": "=DERECHA(texto;número)",
    "p50": "Extrae la cantidad de carácteres especificada por número desde texto, iniciando de la derecha.",
    "p51": "Funciones de Fecha y Hora",
    "p52": "También existe la posibilidad de obtener ciertas informaciones de fecha y hora, así como trabajar con ellas.",
    "p53": "Función",
    "p54": "Descripción",
    "p55": "=AHORA()",
    "p56": "Entrega la fecha actual junto con la hora.",
    "p57": "=DIAS(fecha1;fecha2)",
    "p58": "A partir de la fecha1 y fecha2 entregadas, devuelve la cantidad de días que hay entre ambas.",
    "p59": "=FECHA(año;mes;día)",
    "p60": "Devuelve en formato fecha del año, mes y día ingresados, los 3 de forma numérica.",
    "p61": "=HOY()",
    "p62": "Entrega la fecha actual",
    "p63": "Funciones Lógicas",
    "p64": "Con la ayuda de ciertas funciones, es posible obtener resultados de conjuntos de comparaciones, como también expresar resultados distintos considerando esas comparaciones. Para realizar estas comparaciones se hace uso de los operadores lógicos vistos en el tópico Formulas y deben ir rodeadas de comillas (\" \"). Para una explicación más detallada revisar los videos adjuntos.",
    "p65": "Función",
    "p66": "Descripción",
    "p67": "=Y(comparación1;[comparación2];...)",
    "p68": "Verifica todas las comparaciones entregadas y devuelve VERDADERO en caso que todas sean verdaderas, en cambio, devuelve FALSO.",
    "p69": "=O(comparación1;[comparación2];...)",
    "p70": "Verifica todas las comparaciones entregadas y devuelve VERDADERO en caso que alguna sea verdadera, en cambio, devuelve FALSO.",
    "p71": "=SI(comparación;siVerdadero;siFalso)",
    "p72": "Verifica la comparación entregada, si ésta es verdadera devuelve lo especificado en siVerdadero, en cambio, devuelve siFalso.",
    "p73": "=SI.CONJUNTO(comparación1;siVerdadero1;[comparación2];[siVerdadero2];...)",
    "p74": "Verifica por orden cada comparación entregada, a la primera que encuentre verdadera, devuelve el siVerdadero correspondiente."
}