{
    "p0": "Funciones",
    "p1": ["Excel pone ","funciones"," a nuestra disposición, que corresponden a fórmulas preexistentes que pueden ser utilizadas mediante un nombre y argumentos. Existen funciones de todo tipo, y todas ellas respetan la sintaxis presentada en la siguiente imagen:"],
    "p2": ["Dado que las ","funciones"," son fórmulas, su invocación debe comenzar con un signo igual (=). Luego, se debe escribir el nombre de la función, y entre paréntesis, introducir los ","argumentos"," de la función separados por punto y coma (;). Un argumento es un valor que recibe la función para trabajar con él y poder dar un resultado, al igual que las funciones usadas en matemáticas. Si en la descripción de una función el argumento se encuentra entre paréntesis de corchete ([ ]), quiere decir que su ingreso es opcional. Cabe destacar que a veces es posible utilizar una función como argumento de otra función; en este caso la función argumento no lleva el signo igual (=)."],
    "p3": ["Para encontrar las funciones, se debe hacer click en el botón ","fx"," a la izquierda de la barra de fórmulas o en la pestaña ","Fórmulas",". Se desplegará la siguiente ventana donde se podrán encontrar las funciones separadas por categoría, en conjunto a la descripción de cada una y los argumentos que recibe."],
    "p4": "A continuación, se describirán brevemente las funciones más utilizadas de cada categoría.",
    "p5": "Funciones Matemáticas",
    "p6": "En este apartado se pueden encontrar funciones para resolver cálculos trigonométricos, estadísticos, financieros y de matemática básica. Las funciones utilizadas con mayor frecuencia son las siguientes:",
    "p7": [["Función","Descripción"],
           ["=ALEATORIO.ENTRE(número1;número2)","Devuelve un número aleatorio entre los valores número1 y número2 entregados"],
           ["=REDONDEAR(número;cantidadDecimales)","Devuelve el número entregado redondeado a la cantidad de decimales especificados"],
           ["=SUMA(número1;número2;...)","Devuelve la suma de todos los números entregados. Recibe una cantidad variable de argumentos."],
           ["=SUMAR.SI(rangoNúmeros;criterio;[rangoSuma])","A partir del rango de números entregado, verifica elemento por elemento si cumple el criterio lógico proporcionado. En caso de cumplirlo, suma los elemento correspondiente de rangoSuma; si éste no fue proporcionado, realiza la suma con rangoNúmeros. Para una explicación más detallada revise los videos adjuntos."],
           ["=PROMEDIO(número1;número2;...)","Devuelve el promedio de todos los números entregados. Recibe una cantidad variable de argumentos."],
           ["=MAX(número1;número2;...)","Devuelve el número mayor de todos los números entregados. Recibe una cantidad variable de argumentos."],
           ["=MIN(número1;número2;...)","Devuelve el número menor de todos los números entregados. Recibe una cantidad variable de argumentos."],
           ["=CONTAR(valor1;valor2;...)","Devuelve la cantidad de valores numéricos entregados. En general, se utiliza referenciando un rango de celdas para saber la cantidad de éstas que contienen valores numéricos."],
           ["=CONTAR.SI(rango;criterio)","A partir del rango entregado, cuenta la cantidad de celdas que cumplen con el criterio lógico entregado. Para una explicación más detallada revise los videos adjuntos."],
           ["=CONTARA(valor1;valor2;...)","Devuelve la cantidad de valores no vacíos entregados. En general, se utiliza referenciando un rango de celdas para saber la cantidad de éstas que no están vacías."]],
    "p8": "Funciones de Texto",
    "p9": "En Excel, existen funciones que nos permiten trabajar con textos. De esta forma, se pueden obtener ciertas secciones de ellos, compararlos e incluso transformarlos. Es importante mencionar que si el texto del argumento es ingresado de forma textual (y no como referencia), éste debe ir rodeado de comillas (\"\").",
    "p10": [["Función","Descripción"],
            ["=CONCAT(texto1;texto2;...)","Concatena (une) los textos entregados, formando un solo texto. Recibe una cantidad variable de argumentos."],
            ["=IGUAL(texto1;texto2)","Compara el texto1 y texto2, entregando VERDADERO si son iguales o FALSO si son distintos."],
            ["=LARGO(texto)","Devuelve el largo del texto entregado, la cantidad de caracteres."],
            ["=MAYUSC(texto)","Transforma el texto entregado, escribiendolo solo con mayúsculas."],
            ["=MINUSC(texto)","Transforma el texto entregado, escribiendolo solo con minúsculas."],
            ["=NOMPROPIO(texto)","Transforma el texto entregado, escribiendo con mayúscula la primera letra de cada palabra y el resto en minúsculas."],
            ["=ENCONTRAR(texto1;texto2)","Busca el texto1 en el texto2 y entrega la posición en que lo encuentra."],
            ["=IZQUIERDA(texto;número)","Extrae la cantidad de caracteres especificada por número desde texto, partiendo de la izquierda."],
            ["=DERECHA(texto;número)","Extrae la cantidad de caracteres especificada por número desde texto, partiendo de la derecha."]],
    "p11": "Funciones de Fecha y Hora",
    "p12": "Excel también pone a nuestra disposición algunas funciones que nos permite obtener y manipular datos de tiempo, tales como la fecha y la hora.",
    "p13": [["Función","Descripción"],
            ["=AHORA()","Entrega la fecha actual junto con la hora."],
            ["=DIAS(fecha1;fecha2)","A partir de la fecha1 y fecha2 entregadas, devuelve la cantidad de días que hay entre ambas."],
            ["=FECHA(año;mes;día)","Devuelve en formato fecha del año, mes y día ingresados, los 3 de forma numérica."],
            ["=HOY()","Entrega la fecha actual"]],
    "p14": "Funciones Lógicas",
    "p15": ["Con la ayuda de ciertas funciones, es posible obtener resultados de conjuntos de comparaciones, como también expresar resultados distintos considerando dichas comparaciones. Para ello, se utilizan los operadores lógicos vistos en el tópico ","Fórmulas",", y deben ir rodeados de comillas (\"\"). Para una explicación más detallada, revisar los videos adjuntos."],
    "p16": [["Función","Descripción"],
            ["=Y(comparación1;[comparación2];...)","Verifica todas las comparaciones entregadas y devuelve VERDADERO en caso que todas sean verdaderas. En caso contrario, devuelve FALSO."],
            ["=O(comparación1;[comparación2];...)","Verifica todas las comparaciones entregadas y devuelve VERDADERO en caso que alguna sea verdadera. En caso contrario, devuelve FALSO."],
            ["=SI(comparación;siVerdadero;siFalso)","Verifica la comparación entregada: si ésta es verdadera, devuelve lo especificado en siVerdadero. En caso contrario, devuelve siFalso."],
            ["=SI.CONJUNTO(comparación1;siVerdadero1;[comparación2];[siVerdadero2];...)","Verifica por orden cada comparación entregada. A la primera que encuentre verdadera, devolverá el siVerdadero correspondiente."]]
}