{
    "p0": "Formato Condicional",
    "p1": ["En la pestaña ","Inicio"," se encuentran distintas opciones que permiten dar formato a las celdas, tales como modificar sus bordes, el color de fondo e incluso la tipografía. Adicionalmente, es posible dar un formato a las celdas a partir de ciertas condiciones. Para lograrlo, se utiliza la sección ","Formato Condicional"," ubicada en la pestaña de ","Inicio","."],
    "p2": ["En esta sección existen varias reglas predefinidas con sus formatos ya establecidos, así como en el grupo ","Escalas de color"," hay una gran variedad de colores a utilizar. Es importante mencionar que estos formatos tienen su condición preestablecida, pero no siempre se trabajará con ella y se necesitarán algunas modificaciones. Para modificar tales condiciones, tenemos que hacer uso del botón ","Más reglas..."," de cada grupo."],
    "p3": ["Al ingresar a ","Más reglas..."," se puede apreciar la siguiente ventana. Aquí se da la opción de alterar las condiciones y parámetros del formato a generar. Es posible modificar el tipo de regla, así como qué color usar de fondo, con qué rangos y el tipo de dato con el que se está trabajando. Estos parámetros serán distintos con cada formato condicional que se implemente."],
    "p4": "Con los parámetros asignados en la imagen anterior, se generó el formato condicional para un rango de celdas obteniendo el resultado de la imagen siguiente. A un rango de 1 a 10, se le configuró como fondo un degradé de rojo a verde desde el mínimo valor al máximo. De esta forma, y extrapolando a una mayor cantidad de datos, es posible asignar formatos como colores de forma automática sin tener que ir celda por celda. Esto es realmente util para obtener nociones de los valores de un conjunto de celdas.",
    "p5": ["Si se desea modificar alguna regla establecida, al final de la pestaña ","Formato Condicional"," se puede ingresar a ","Administrar reglas...",". Ahí se encuentran todas las reglas utilizadas, dando la posibilidad de editarlas o eliminarlas."]
}