{
    "p0": "Formato Tabla",
    "p1": "Para una mejor representación y estructura, es posible darle a un rango de celdas lo que se llama Formato Tabla, otorgando características y propiedades adecuadas de una tabla de datos a tal rango.",
    "p2.1": "En la pestaña ",
    "p2.2": "Inicio",
    "p2.3": " es posible encontrar esta opción. Luego de seleccionar el rango deseado, se puede elegir un diseño a gusto para aplicar, tal como se ve a continuación.",
    "p3": "Entre las características mencionadas se puede apreciar la modificación del rango de la tabla. Al hacer click en el triangulo de la esquina inferior derecha de la tabla creada y arrastrar a la derecha o abajo, es posible agregar columnas o filas. Con este proceso los formatos a las celdas se aplican automaticamente y, si es posible para Excel, se genera el título de la columna. Tal como ocurre en el ejemplo siguiente.",
    "p4": "Además, al ser un tabla el conjunto de celdas, sus columnas se comportan como un todo. Si se establece un formula en una de las celdas de una columna, al ingresar ésta se aplicará para la totalidad de la columna, evitando tener que usar seleccionar y arrastrar.",
    "p5.1": "Ya que en las tablas es común realizar cálculos entre sus datos, es posible crear una ",
    "p5.2": "Fila Total",
    "p5.3": ". Si se ingresa una formula al final de la tabla, así como suma, promedio o mediana, una nueva fila se generará en tabla, la cual es reconocible por tener un borde superior e inferior. La siguiente imagen muestra un ejemplo de ello.",
    "p6": "La peculiariedad de esta fila total es que se mantendrá al final de la tabla no importa cuantas nuevas filas se agreguen. Es posible observarlo al modificar el rango de la siguiente tabla",
    "p7": "Otro aspecto a mencionar, es que a las tablas generadas vienen con la cualidad de poder aplicarles filtros a sus datos. Se puede observar que en los encabezados de la tabla aparecen unas pestañas, al hacer click en ellas se desplegará la ventana de filtros, donde es posible seleccionar solo algunas filas a mostrar (tal como se ve en el ejemplo) o ordenar las filas bajo ciertos criterios. Esta cualidad es realmente útil en grandes tablas, donde con tal cantidad de información es facil perderse.",
    "p8": "Finalmente, la última característica ha mencionar del formato tabla es el nombre de rango que se le aplica a esta. Al dirigirse a la pestaña que se encuentra a la izquierda de la barra de formulas, se puede encontrar el nombre de la celda o rango. Si se despliega la pestaña se encontrará el nombre de la tabla, al hacer click en ello el rango de la tabla se seleccionará. Esto ocurre ya que el rango al que corresponde la tabla se le aplicó un nombre automáticamente, por lo que es posible referenciar ese rango por medio de su nombre. También es posible realizar este proceso de forma manual al seleccionar un rango o celda, dirigirse a la misma pestaña y escribir el nombre deseado.",
    "p9": "La propiedad de nombre de rango facilita la referencia a celdas o rangos, ya que se evita escribir filas y columnas, y en cambio, se referencia mediante nombres."
}