{
    "p0": "Formato Tabla",
    "p1": ["Para una mejor representación y estructura, es posible darle a un rango de celdas lo que se llama ","Formato Tabla",", otorgando características y propiedades adecuadas de una tabla de datos a tal rango."],
    "p2": ["En la pestaña ","Inicio"," es posible encontrar esta opción. Luego de seleccionar el rango deseado, se puede elegir un diseño a gusto para aplicar, tal como se ve a continuación."],
    "p3": "Entre las características mencionadas se puede apreciar la modificación del rango de la tabla. Al hacer click en el triángulo de la esquina inferior derecha de la tabla creada y arrastrar a la derecha o abajo, es posible agregar columnas o filas. Con este proceso los formatos a las celdas se aplican automáticamente y, si es posible para Excel, se genera el título de la columna como se muestra en el siguiente ejemplo:",
    "p4": "Además, al ser la tabla un conjunto de celdas, sus columnas se comportan como un todo. Si se establece una fórmula en una de las celdas de una columna, al ingresarla se aplicará sobre todos los datos de la columna, evitando tener que usar seleccionar y arrastrar.",
    "p5": ["Ya que en las tablas es común realizar cálculos entre sus datos, es posible crear una ","Fila Total",". Si se ingresa una fórmula al final de la tabla, así como suma, promedio o mediana, una nueva fila se generará en tabla, la cual es reconocible por tener un borde superior e inferior. La siguiente imagen muestra un ejemplo de ello."],
    "p6": "La peculiaridad de esta fila total es que se mantendrá al final de la tabla no importa cuantas nuevas filas se agreguen. Es posible observarlo al modificar el rango de la siguiente tabla",
    "p7": "Otro aspecto a mencionar es que las tablas generadas permiten filtrar los datos contenidos en ella. Se puede observar que en los encabezados de la tabla aparecen unas pestañas, y tras hacer click en ellas se desplegará la ventana de filtros, donde es posible seleccionar solo algunas filas a mostrar (tal como se ve en el ejemplo), u ordenar las filas bajo ciertos criterios. Esta cualidad es realmente útil en tablas grandes, donde es fácil perderse entre la gran cantidad de información disponible.",
    "p8": "La última característica a mencionar es el nombre de rango que se le aplica a la tabla. Al dirigirse a la pestaña que se encuentra a la izquierda de la barra de fórmulas, se puede encontrar el nombre de la celda o rango. Si se despliega la pestaña, se encontrará el nombre de la tabla, y al hacer click en él, el rango de la tabla se seleccionará. Esto ocurre debido a que, automáticamente, se le aplicó un nombre al rango que contiene los datos de la tabla. Luego, es posible referenciar ese rango por medio de su nombre. También es posible realizar este proceso de forma manual al seleccionar un rango o celda, dirigirse a la misma pestaña y escribir el nombre deseado.",
    "p9": "La propiedad de nombre de rango facilita la referencia a celdas o rangos, ya que se evita escribir filas y columnas, y en cambio, se referencia mediante nombres."
}