{
    "p0": "Filtros",
    "p1": ["En el tópico anterior, dentro de las características del formato tabla se habló de los ","filtros",". Estos no son exclusivos de tal formato, son aplicados de forma automática a la tabla pero pueden usarse de manera independiente. Se pueden encontrar en la pestaña ","Inicio",", en el apartado de edición o en las pestaña ","Datos",", en el apartado de ordenar y filtrar."],
    "p2": "Para aplicar los filtros es necesario seleccionar los datos a filtrar o solo posicionarse en tal conjunto. Luego aplicar filtros en la pestaña elegida para activar la función.",
    "p3": "Su funcionamiento es identico a como se vió en el tópico anterior. Para realizar un filtro es necesario desplegar la pestaña del encabezado y seleccionar solo los datos que se desean ver, ocultandose así las filas con los datos no seleccionadas.",
    "p4": "Además de filtrar, es posible ordenar los datos por abecedario o un orden personalizado. Para esto se despliega la misma pestaña de la columna que se quiere ordenar y se selecciona el tipo de orden deseado. Cabe destacar que las otras columnas se adecuarán al nuevo orden solo si tienen activada la función de filtro en ellas, las otras mantendran su orden anterior.",
    "p5": "Filtros avanzados",
    "p6": "Existe una funcionalidad más avanzada, con la cual a través de una tabla de criterios es posible modificar la tabla actual o crear una nueva en otra celda ingresando ciertos filtros como parámetros. La tabla de criterios debe escribirse en la hoja de Excel y su estructura es presentada en la siguiente imagen.",
    "p7": ["Los encabezados de la tabla serán los encabezados de los datos a los cuales se querrá aplicar un filtro. El cuerpo de la tabla contendrá los filtros deseados. Dentro de cada fila de la tabla se aplicará la operación ","Y"," entre los filtros y entre cada fila se aplicará la operación ","O",". Un campo vacio significa que no se aplica filtro en ese encabezado. Se realizarán 3 ejemplos para un mayor entendimiento del proceso."],
    "p8": "En el primer caso, se elaboró una tabla de criterios, cuyo filtro solo aplica que la comuna sea Santiago y la edad sea 25 (por estar ambos criterios en la misma fila).",
    "p9": "El segundo caso posee una tabla más elaborada, la tabla filtra que la comuna sea Santiago y con cualquier edad, o que sea cualquier comuna y con edad igual a 25 (por estar en distintas filas).",
    "p10": "Como se puede apreciar en el tercer caso, es posible el uso de símbolos en los criterios. Aquí se filtra que la comuna sea Santiago y que el edad sea mayor o igual a 25.",
    "p11": ["Importante:"," La tabla generada por medio de filtros avanzados no puede ser eliminada por medio de la herramienta Deshacer (Ctrl + z), debe ser borrada a mano en caso de una nueva tabla o mediante el botón 'Borrar' (de la sección de filtros) en caso de reemplazar la original."]
}