{
    "p0": "Teoría",
    "p1": ["En unidades anteriores se estudiaron algunas de las funciones disponibles en Excel, como ","=promedio(), =buscarv(), =redondear,"," entre otras."],
    "p2": "Estas funciones están construidas en VBA, por lo que es posible crear funciones propias desde cero, con un nombre personalizado y con los parámetros que se estime conveniente. Para crearlas, se debe trabajar en un módulo (al igual que con las subrutinas) utilizando el procedimiento Function, el cual tiene una sintaxis similar a Sub.",
    "p3": ["Se inicia con la palabra reservada ","Function",". Luego, se debe ingresar el ","nombre"," que se le dará a la función, el cual tiene las mismas restricciones que el nombre de variables y subrutinas. Dentro de los paréntesis se ingresan los parámetros de la función, que pueden ser 1 o más."],
    "p4": ["Es importante especificar el tipo de dato de cada parametro, por lo que junto a cada uno de ellos se escribe la palabra reservada ","As",", junto con el tipo de dato que le corresponde al parámetro (Integer, String, etc.). Después de los paréntesis, se debe especificar el ","tipo de dato del retorno"," de la función, el cual corresponde al valor que entregará como resultado la función."],
    "p5": ["Al igual que las subrutinas, dentro de Function se encontrarán todas las instrucciones y se debe finalizar declarando una importante variable, cuyo nombre será el ","nombre"," de la función y su valor será el ","valor que queremos retornar"," (el resultado de la función). Cabe destacar que en el procedimiento Function no es posible referenciar celdas del libro, por lo que cualquier dato requerido debe ser entregado como parámetro. Para cerrar la función se utilizan las palabras reservadas ","End Function","."],
    "p6": ["A continuación, se presenta un ejemplo de creación de una función, la cual se llama ","sumaEnteros",", y que recibe dos parámetros de tipo Integer (num1, num2), retornando un valor de tipo Long."],
    "p7": ["Dentro de la función se crea la variable ","resultadoSuma",", donde se almacena el resultado del procedimiento, por lo que su tipo coincide con el especificado en el encabezado de la función. Posteriormente se realiza el cálculo y el resultado es almacenado en una variable de mismo nombre que la función. Esta última variable no se debe crear por medio de ","Dim","."],
    "p8": "Finalizada ya la función, es posible usarla de la misma forma que las funciones predefinidas de Excel",
    "p9": "Las referencias estudiadas en la Unidad 1 funcionan perfectamente con las funciones creadas y, así como en la hoja de cálculo, también se pueden utilizar la funciones creadas dentro de una subrutina. La lógica es la misma, se le entregan datos como parámetro y la función entrega un resultado, pero la sintáxis cambia al utilizar la función en código.",
    "p10": ["Como se puede observar, en la subrutina ","sumar"," se está utilizando la función ","sumaEnteros",". Para esto, se crean dos variables cuyo tipo de dato coincide con los parámetros, y una tercera variable cuyo tipo sea el del retorno. Luego, se les asigna valores a las varibles ","num1 y num2",", los cuales pueden ser explícitos o referenciados de alguna celda. La sintaxis del llamado de la función es igual que en la hoja de calculo, exceptuando que se deben reemplazar los punto y coma (;) por coma (,). También es necesario almacenar en alguna variable el retorno de la función, para poder trabajar luego con él. Esto se realiza dándole como valor a la variable la función. En la subrutina ","sumar",", se le asigna el retorno de la función a la variable ","resultado","."]
}